Revit 2024 API
StairsComponentConnection Class
 Represents information about a connection among stairs components(run to landing).
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class StairsComponentConnection : IDisposable
Visual Basic
Public Class StairsComponentConnection _
	Implements IDisposable
Visual C++
public ref class StairsComponentConnection : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Architecture.StairsComponentConnection
See Also
StairsComponentConnection Members
Autodesk.Revit.DB.Architecture Namespace